Revit 2024 API
Stairs.ActualRisersNumber Property
 The total number of actually created risers in model.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int ActualRisersNumber { get; }
Visual Basic
Public ReadOnly Property ActualRisersNumber As Integer
	Get
Visual C++
public:
property int ActualRisersNumber {
	int get ();
}
Remarks
 The number of steps needed to go through when moving from the base level to the top level of the stairs.
See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace